An Emacs configuration tour

#+startup: overview
#+language: en
#+drawers: PROPERTIES FEEDSTATUS
#+filetags: emacs
#+todo: TODO | DONE CANCELED
#+style: <link rel="stylesheet" type="text/css" href="css/clean.css" />
#+options: H:2 toc:nil todo:t email:t ^:nil

** Extending Emacs, packages repositories, etc

The easiest way to extend Emacs features is to use =list-package= and
install packages from remote repositories. But =package.el= is rather
new and not all libraries are available in the form of packages. When
a library must be installed by hand, a good practice is to always put
it in the directory =~/.config/emacs/lisp=. The load path is extended
accordingly.

#+begin_src emacs-lisp :tangle init.el
(add-to-list 'load-path (expand-file-name "~/.config/emacs/lisp/"))
#+end_src

The default is to fetch packages from the GNU Emacs packages
repository. There are usefull packages in other places like [[http://tromey.com/elpa/][ELPA]] and
[[http://marmalade-repo.org/][Marmalade]].

#+begin_src emacs-lisp :tangle init.el
(with-eval-after-load "package"
  (add-to-list 'package-archives '("melpa". "https://melpa.org/packages/")))
#+end_src

At the time of writing, I have activated the following packages:

#+begin_src emacs-lisp :exports results :results value raw
(let ((descriptions "|Package|Description|\n|---|\n"))
  (dolist (package (sort package-alist) descriptions)
    (let ((name (car package))
          (desc (package-desc-summary (cadr package))))
    (setq descriptions
          (concat descriptions (format "|%s|%s|\n" name desc))))))
#+end_src

#+RESULTS:
| Package            | Description                                                 |
|--------------------+-------------------------------------------------------------|
| CMake-doc          | Info documentation for CMake                                |
| Python-doc         | Info documentation for Python                               |
| adoc-mode          | a major-mode for editing AsciiDoc files                     |
| bitbake-modes      | Major modes for editing bitbake bb* and conf files.         |
| breadcrumb         | project and imenu-based breadcrumb paths                    |
| capnp-mode         | Major mode for editing Capn' Proto Files                    |
| cmake-mode         | Major-mode for editing CMake sources.                       |
| corfu              | COmpletion in Region FUnction                               |
| csv-mode           | Major mode for editing comma/char separated values          |
| devicetree-ts-mode | Tree-sitter support for DTS                                 |
| diminish           | Diminished modes are minor modes with no modeline display   |
| edit-indirect      | Edit regions in separate buffers                            |
| eglot              | The Emacs Client for LSP servers                            |
| feature-mode       | Major mode for editing Gherkin (i.e. Cucumber) user stories |
| git-link           | No description available.                                   |
| gptel              | Interact with ChatGPT or other LLMs                         |
| guess-language     | Robust automatic language detection                         |
| jsonrpc            | JSON-RPC library                                            |
| marginalia         | Enrich existing commands with completion annotations        |
| markdown-mode      | Major mode for Markdown-formatted text                      |
| mermaid-mode       | Major mode for working with mermaid graphs.                 |
| mermaid-ts-mode    | Major mode for Mermaid                                      |
| meson-mode         | Major mode for the Meson build system files.                |
| minimap            | Sidebar showing a "mini-map" of a buffer                    |
| mmm-mode           | Allow Multiple Major Modes in a buffer                      |
| modus-themes       | Elegant, highly legible and customizable themes             |
| nsis-mode          | NSIS-mode.                                                  |
| pdf-tools          | Support library for PDF documents                           |
| powershell         | Mode for editing PowerShell scripts                         |
| pulsar             | Pulse highlight on demand or after select functions         |
| qt-pro-mode        | Qt Pro/Pri major mode                                       |
| rainbow-mode       | Colorize color names in buffers                             |
| restclient         | No description available.                                   |
| sops               | SOPS encrypt and decrypt without leaving the editor.        |
| spacious-padding   | Increase the padding/spacing of frames and windows          |
| ssass-mode         | Edit Sass without a Turing Machine                          |
| structurizr-mode   | No description available.                                   |
| systemd            | Major mode for editing systemd units                        |
| tablist            | Extended tabulated-list-mode.                               |
| vue-html-mode      | Major mode for editing Vue.js templates                     |
| vue-mode           | Major mode for vue component based on mmm-mode              |
| x509-mode          | View certificates, CRLs and keys using OpenSSL.             |


All settings written using the customize library go to a dedicated
file that is loaded when the loading of the [[file:.init.el][configuration file]] ends.

#+begin_src emacs-lisp :noweb yes
<<init.el_custom-file_loading>>
#+end_src

When the custom settings are loaded, a machine specific file is
loaded. The file name comes from the host name of the machine Emacs is
running on.

#+begin_src emacs-lisp :noweb yes
<<init.el_system-name_loading>>
#+end_src

